tymmothy/LPC11xx_Device_Lib_v1.2/inc/lpc11xx/iocon.h
/**************************************************************************//**
 * @file     iocon.h
 * @brief    IO Configuration Interface Header for LPC11xx Microcontrollers
 * @version  V1.0
 * @author   Tymm Twillman
 * @date     1. January 2012
 ******************************************************************************
 * @section Overview
 * This file gives a basic interface to the IO configuration block of
 * NXP LPC11xx microcontrollers.  It abstracts such things as configuring
 * the peripheral controlling IO pins, enabling pull-up/pull-down resistors,
 * and enabling digital mode for ADC input pins configured as GPIO.
 *
 * @note
 * This file does not handle the following necessary steps for IOCON use:
 * - The IOCON (AHB or APB/VPB) bus clock line must be enabled
 ******************************************************************************
 * @section License
 * Licensed under a Simplified BSD License:
 *
 * Copyright (c) 2012, Timothy Twillman
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions are met:
 *
 *    1. Redistributions of source code must retain the above copyright notice,
 *        this list of conditions and the following disclaimer.
 *
 *    2. Redistributions in binary form must reproduce the above copyright
 *       notice, this list of conditions and the following disclaimer in the
 *       documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED ''AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
 * AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL
 * TIMOTHY TWILLMAN OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
 * NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 * THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * The views and conclusions contained in the software and documentation are
 * those of the authors and should not be interpreted as representing official
 * policies, either expressed or implied, of Timothy Twillman.
 *****************************************************************************/

#ifndef NXP_LPC_IOCON_H_
#define NXP_LPC_IOCON_H_

#ifdef __cplusplus
extern "C" {
#endif


/* Includes -----------------------------------------------------------------*/

#include <stdint.h>

#include "lpc11xx.h"
#include "lpclib_assert.h"


/**
  * @defgroup IOCON_AbstractionLayer IOCON (IO Configuration Block) Abstraction Layer
  * @ingroup  LPC_Peripheral_AbstractionLayer
  * @{
  */

/* Types & Type-Related Definitions -----------------------------------------*/

/** @defgroup IOCON_Types IOCON Interface Types and Type-Related Definitions
  * @{
  */

/** @defgroup IOCON_Pin_Locations IOCON Block Pin Locations
  * @{
  */

/*! @brief IOCON Pin Locations */
typedef enum {
    IOCON_Pin_2_6 = 0x00,                                  /*!< Port 2 pin 6                     */
    IOCON_Pin_2_0 = 0x02,                                  /*!< Port 2 pin 0                     */
    IOCON_Pin_0_0,                                         /*!< Port 0 pin 0                     */
    IOCON_Pin_0_1,                                         /*!< Port 0 pin 1                     */
    IOCON_Pin_1_8,                                         /*!< Port 1 pin 8                     */
    IOCON_Pin_0_2 = 0x07,                                  /*!< Port 0 pin 2                     */
    IOCON_Pin_2_7,                                         /*!< Port 2 pin 7                     */
    IOCON_Pin_2_8,                                         /*!< Port 2 pin 8                     */
    IOCON_Pin_2_1,                                         /*!< Port 2 pin 1                     */
    IOCON_Pin_0_3,                                         /*!< Port 0 pin 3                     */
    IOCON_Pin_0_4,                                         /*!< Port 0 pin 4                     */
    IOCON_Pin_0_5,                                         /*!< Port 0 pin 5                     */
    IOCON_Pin_1_9,                                         /*!< Port 1 pin 9                     */
    IOCON_Pin_3_4,                                         /*!< Port 3 pin 4                     */
    IOCON_Pin_2_4,                                         /*!< Port 2 pin 4                     */
    IOCON_Pin_2_5,                                         /*!< Port 2 pin 5                     */
    IOCON_Pin_3_5,                                         /*!< Port 3 pin 5                     */
    IOCON_Pin_0_6,                                         /*!< Port 0 pin 6                     */
    IOCON_Pin_0_7,                                         /*!< Port 0 pin 7                     */
    IOCON_Pin_2_9,                                         /*!< Port 2 pin 9                     */
    IOCON_Pin_2_10,                                        /*!< Port 2 pin 10                    */
    IOCON_Pin_2_2,                                         /*!< Port 2 pin 2                     */
    IOCON_Pin_0_8,                                         /*!< Port 0 pin 8                     */
    IOCON_Pin_0_9,                                         /*!< Port 0 pin 9                     */
    IOCON_Pin_0_10,                                        /*!< Port 0 pin 10                    */
    IOCON_Pin_1_10,                                        /*!< Port 1 pin 10                    */
    IOCON_Pin_2_11,                                        /*!< Port 2 pin 11                    */
    IOCON_Pin_0_11,                                        /*!< Port 0 Pin 11                    */
    IOCON_Pin_1_0,                                         /*!< Port 1 Pin 0                     */
    IOCON_Pin_1_1,                                         /*!< Port 1 Pin 1                     */
    IOCON_Pin_1_2,                                         /*!< Port 1 Pin 2                     */
    IOCON_Pin_3_0,                                         /*!< Port 3 Pin 0                     */
    IOCON_Pin_3_1,                                         /*!< Port 3 Pin 1                     */
    IOCON_Pin_2_3,                                         /*!< Port 2 Pin 3                     */
    IOCON_Pin_1_3,                                         /*!< Port 1 Pin 3                     */
    IOCON_Pin_1_4,                                         /*!< Port 1 Pin 4                     */
    IOCON_Pin_1_11,                                        /*!< Port 1 Pin 11                    */
    IOCON_Pin_3_2,                                         /*!< Port 3 Pin 2                     */
    IOCON_Pin_1_5,                                         /*!< Port 1 Pin 5                     */
    IOCON_Pin_1_6,                                         /*!< Port 1 Pin 6                     */
    IOCON_Pin_1_7,                                         /*!< Port 1 Pin 7                     */
    IOCON_Pin_3_3                                          /*!< Port 3 Pin 3                     */
} IOCON_Pin_Type;

/*! @brief Macro to test whether parameter is a valid IO Pin */
#define IOCON_IS_PIN(Pin)  (((Pin) >= IOCON_Pin_2_6) \
                         && ((Pin) <= IOCON_Pin_3_3) \
                         && ((Pin) != 0x01)          \
                         && ((Pin) != 0x06))

/*! @brief Macro to test whether parameter is a valid ADC Pin */
#define IOCON_IS_AD_PIN(Pin)   (((Pin) == IOCON_Pin_0_11) \
                             || ((Pin) == IOCON_Pin_1_0)  \
                             || ((Pin) == IOCON_Pin_1_1)  \
                             || ((Pin) == IOCON_Pin_1_2)  \
                             || ((Pin) == IOCON_Pin_1_3)  \
                             || ((Pin) == IOCON_Pin_1_4)  \
                             || ((Pin) == IOCON_Pin_1_10) \
                             || ((Pin) == IOCON_Pin_1_11))

/*! @brief Macro to test whether parameter is a valid I2C Pin */
#define IOCON_IS_I2C_PIN(Pin)  (((Pin) == IOCON_Pin_0_4) \
                             || ((Pin) == IOCON_Pin_0_5))

#if defined(LPC11XXL) /* L-series Parts Only */
/*! @brief Macro to test whether parameter is a valid (pseudo) Open Drain Pin */
# define IOCON_IS_OD_PIN(Pin)  (IOCON_IS_PIN(Pin) && (!IOCON_IS_I2C_PIN(Pin)))
#endif

/** @} */

/** @defgroup IOCON_Function_Settings  IO Configuration Block Pin Function Settings
  * @{
  */

