tymmothy/LPC11xx_Device_Lib_v1.2/inc/lpc11xx/iocon.h
/*! @brief IOCON Pin Function settings
 *  These names are pretty non-descriptive, but are used to build more useful
 *  simplified pin settings below.
 */
typedef enum {
    IOCON_Function_Default = 0x00,                         /*!< Default Pin Function Setting     */
    IOCON_Function_Alt1,                                   /*!< Alternate Pin Function #1        */
    IOCON_Function_Alt2,                                   /*!< Alternate Pin Function #2        */
    IOCON_Function_Alt3,                                   /*!< Alternate Pin Function #3        */
} IOCON_Function_Type;

/*! @brief Macro to test whether parameter is a valid IOCON pin function */
#define IOCON_IS_FUNCTION(Function) \
                                  (((Function) == IOCON_Function_Default) \
                                || ((Function) == IOCON_Function_Alt1)    \
                                || ((Function) == IOCON_Function_Alt2)    \
                                || ((Function) == IOCON_Function_Alt3))

#define IOCON_Function_Mask            (0x03)              /*!< Function bits in IOCON registers */

/** @} */

/** @defgroup IOCON_Modes IO Configuration Pin Pullup / Pulldown Modes
  * N/A on I2C Pins IOCON_Pin_PIO_0_4, IOCON_Pin_PIO_0_5
  * @{
  */

/*! @brief IOCON Pin Mode Configuration Settings */
typedef enum {
    IOCON_Mode_Normal   = 0x00,                            /*!< Normal mode (no PU/PD resistors) */
    IOCON_Mode_PD       = 0x08,                            /*!< Pulldown resistor enabled        */
    IOCON_Mode_PU       = 0x10,                            /*!< Pullup resistor enabled          */
    IOCON_Mode_Repeater = 0x18                             /*!< Repeater Mode enabled on pin     */
} IOCON_Mode_Type;

/*! @brief Macro to test whether parameter is a valid IOCON pin mode */
#define IOCON_IS_MODE(Mode) (((Mode) == IOCON_Mode_Normal) \
                               || ((Mode) == IOCON_Mode_PD)     \
                               || ((Mode) == IOCON_Mode_PU)     \
                               || ((Mode) == IOCON_Mode_Repeater))

#define IOCON_Mode_Mask                (0x03 << 3)         /*!< Pin Mode bits in IOCON registers */
#define IOCON_Mode_Shift               (3)                 /*!< Shift of IOCON pin mode bits     */

/** @} */

/** @defgroup IOCON_I2CModes  IO Configuration I2C Modes
  * Applies to IOCON_Pin_PIO_0_4, IOCON_Pin_PIO_0_5 Only
  * @{
  */

/*! @brief IOCON I2C Pin Configuration Modes */
typedef enum {
    IOCON_I2CMode_I2C                  = 0x0000,           /*!< Pin configured for I2C IO        */
    IOCON_I2CMode_PIO                  = 0x0100,           /*!< Pin configured for GPIO          */
    IOCON_I2CMode_I2CFastPlus          = 0x0200            /*!< Pin config'd for I2C FastPlus IO */
} IOCON_I2CMode_Type;

/*! Macro to test whether parameter is a valid IOCON I2C mode */
#define IOCON_IS_I2C_MODE(Mode) (((Mode) == IOCON_I2CMode_I2C) \
                              || ((Mode) == IOCON_I2CMode_PIO) \
                              || ((Mode) == IOCON_I2CMode_I2CFastPlus))

#define IOCON_I2CMode_Mask             (0x03 << 8)         /*!< I2C Mode Bits in IOCON registers */

/** @} */

/** @defgroup IOCON_ADModes  IO Configuration Analog Modes
  * Applies to IOCON_Pin_PIO0_11, IOCON_Pin_PIO1_0, IOCON_Pin_PIO1_1,
  *            IOCON_Pin_PIO1_2,  IOCON_Pin_PIO1_3, IOCON_Pin_PIO1_4,
  *            IOCON_Pin_PIO1_11, IOCON_Pin_PIO1_10
  * @{
  */

/*! @brief IOCON Analog Capable Pin Configuration Modes */
typedef enum {
    IOCON_ADMode_Analog                = 0x00,             /*!< AD pin in analog mode            */
    IOCON_ADMode_Digital               = 0x80              /*!< AD pin in digital mode           */
} IOCON_ADMode_Type;

/*! @brief Macro to test whether parameter is a valid IOCON Analog/Digital Mode */
#define IOCON_IS_AD_MODE(Mode) (((Mode) == IOCON_ADMode_Analog) \
                             || ((Mode) == IOCON_ADMode_Digital))

/** @} */

#if defined(LPC11XXL)  /* L-series parts only */

/** @defgroup IOCON_ODModes  IO Configuration (pseudo) Open Drain Modes
  * Applies to non-I2C Pins
  * @{
  */

/*! @brief IOCON (pseudo) Open-Drain Pin Configuration Modes */
typedef enum {
    IOCON_ODMode_Normal                = 0x0000,           /*!< Pin configured for normal op     */
    IOCON_ODMode_OpenDrain             = 0x0400            /*!< Pin configured for open drain op */
} IOCON_ODMode_Type;

/*! @brief Macro to test whether parameter is a valid IOCON Open Drain Mode */
#define IOCON_IS_OD_MODE(Mode) (((Mode) == IOCON_ODMode_Normal) \
                             || ((Mode) == IOCON_ODMode_OpenDrain))

/** @} */

#endif /* #if defined(LPC11XXL) */

/** @defgroup IOCON_SCK0Locations SSP0 SCK Pin Selections
  * @{
  */

/*! @brief IOCON SSP0 SCK Pin Location Settings */
typedef enum {
    IOCON_SCK0Location_PIO0_10 = 0x00,                     /*!< SSP0 SCK routed to PIO0.10       */
    IOCON_SCK0Location_PIO2_11,                            /*!< SSP0 SCK routed to PIO2.11       */
    IOCON_SCK0Location_PIO0_6                              /*!< SSP0 SCK routed to PIO0.6        */
} IOCON_SCK0Location_Type;

/*! @brief Macro to test whether parameter is a valid SSP0 SCK pin location */
#define IOCON_IS_SCK0_LOCATION(Location) \
                                  (((Location) == IOCON_SCK0Location_PIO0_10) \
                                || ((Location) == IOCON_SCK0Location_PIO2_11) \
                                || ((Location) == IOCON_SCK0Location_PIO0_6))

/** @} */

/** @defgroup IOCON_DSR0Locations UART 0 DSR Pin Selection
  * @{
  */

/*! @brief IOCON UART0 DSR Pin Location Settings */
typedef enum {
    IOCON_DSR0Location_PIO2_1 = 0x00,                      /*!< UART0 DSR routed to PIO2.1       */
    IOCON_DSR0Location_PIO3_1                              /*!< UART0 DSR routed to PIO3.1       */
} IOCON_DSR0Location_Type;

/*! @brief Macro to test whether parameter is a valid UART0 DSR pin location */
#define IOCON_IS_DSR0_LOCATION(Location) \
                                   (((Location) == IOCON_DSR0Location_PIO2_1) \
                                 || ((Location) == IOCON_DSR0Location_PIO3_1))

/** @} */

/** @defgroup IOCON_DCD0Locations UART 0 DCD Pin Selection
  * @{
  */

/*! @brief IOCON UART0 DCD Pin Location Settings */
typedef enum {
    IOCON_DCD0Location_PIO2_2 = 0x00,                      /*!< UART0 DCD routed to PIO2.2       */
    IOCON_DCD0Location_PIO3_2                              /*!< UART0 DCD routed to PIO3.2       */
} IOCON_DCD0Location_Type;

