tymmothy/LPC11xx_Device_Lib_v1.2/inc/lpc11xx/iocon.h
/*! @brief Macro to test whether parameter is a valid UART0 DCD pin location */
#define IOCON_IS_DCD0_LOCATION(Location) \
                                   (((Location) == IOCON_DCD0Location_PIO2_2) \
                                 || ((Location) == IOCON_DCD0Location_PIO3_2))

/** @} */

/** @defgroup IOCON_RI0Locations UART 0 RI Pin Selection
  * @{
  */

/*! @brief IOCON UART0 RI Pin Location Settings */
typedef enum {
    IOCON_RI0Location_PIO2_3 = 0x00,                       /*!< UART0 RI routed to PIO2.3        */
    IOCON_RI0Location_PIO3_3                               /*!< UART0 RI routed to PIO3.3        */
} IOCON_RI0Location_Type;

/*! @brief Macro to test whether parameter is a valid UART0 RI pin location */
#define IOCON_IS_RI0_LOCATION(Location) \
                                   (((Location) == IOCON_RI0Location_PIO2_3) \
                                 || ((Location) == IOCON_RI0Location_PIO3_3))

/** @} */

/** @defgroup IOCON_PinConfigs Simplified Pin Configuration Definitions
  * @{
  */
#define IOCON_PinConfig_2_6_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_2_6)  /*!< Pin 2.6 configured as PIO                    */
#define IOCON_PinConfig_2_0_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_2_0)  /*!< Pin 2.0 configured as PIO                    */
#define IOCON_PinConfig_2_0_DTR0         (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_2_0)  /*!< Pin 2.0 configured as UART0 DTR              */
#define IOCON_PinConfig_2_0_SSEL1        (((((uint16_t)IOCON_Function_Alt2) << 8))    | IOCON_Pin_2_0)  /*!< Pin 2.0 configured as SSP1 SSEL              */
#define IOCON_PinConfig_0_0_Reset        (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_0_0)  /*!< Pin 0.0 configured as /RESET                 */
#define IOCON_PinConfig_0_0_PIO          (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_0_0)  /*!< Pin 0.0 configured as PIO                    */
#define IOCON_PinConfig_0_1_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_0_1)  /*!< Pin 0.1 configured as PIO                    */
#define IOCON_PinConfig_0_1_CLKOUT       (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_0_1)  /*!< Pin 0.1 configured as CLKOUT                 */
#define IOCON_PinConfig_0_1_CT32B0_MAT2  (((((uint16_t)IOCON_Function_Alt2) << 8))    | IOCON_Pin_0_1)  /*!< Pin 0.1 configured as CT32B0 Match Output 2  */
#define IOCON_PinConfig_1_8_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_1_8)  /*!< Pin 1.8 configured as PIO                    */
#define IOCON_PinConfig_1_8_CT16B1_CAP0  (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_1_8)  /*!< Pin 1.8 configured as CT16B0 Capture Input 0 */
#define IOCON_PinConfig_0_2_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_0_2)  /*!< Pin 0.2 configured as PIO                    */
#define IOCON_PinConfig_0_2_SSEL0        (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_0_2)  /*!< Pin 0.2 configured as SSP0 SSEL              */
#define IOCON_PinConfig_0_2_CT16B0_CAP0  (((((uint16_t)IOCON_Function_Alt2) << 8))    | IOCON_Pin_0_2)  /*!< Pin 0.2 configured as CT16B0 Capture Input 0 */
#define IOCON_PinConfig_2_7_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_2_7)  /*!< Pin 2.7 configured as PIO                    */
#define IOCON_PinConfig_2_8_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_2_8)  /*!< Pin 2.8 configured as PIO                    */
#define IOCON_PinConfig_2_1_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_2_1)  /*!< Pin 2.1 configured as PIO                    */
#define IOCON_PinConfig_2_1_DSR0         (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_2_1)  /*!< Pin 2.1 configured as UART0 DSR              */
#define IOCON_PinConfig_2_1_SCK1         (((((uint16_t)IOCON_Function_Alt2) << 8))    | IOCON_Pin_2_1)  /*!< Pin 2.1 configured as SSP1 SCK               */
#define IOCON_PinConfig_0_3_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_0_3)  /*!< Pin 0.3 configured as PIO                    */
#define IOCON_PinConfig_0_4_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_0_4)  /*!< Pin 0.4 configured as PIO                    */
#define IOCON_PinConfig_0_4_SCL0         (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_0_4)  /*!< Pin 0.4 configured as I2C0 SCL               */
#define IOCON_PinConfig_0_5_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_0_5)  /*!< Pin 0.5 configured as PIO                    */
#define IOCON_PinConfig_0_5_SDA0         (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_0_5)  /*!< Pin 0.5 configured as I2C0 SDA               */
#define IOCON_PinConfig_1_9_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_1_9)  /*!< Pin 1.9 configured as PIO                    */
#define IOCON_PinConfig_1_9_CT16B1_MAT0  (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_1_9)  /*!< Pin 1.9 configured as CT16B1 Match Output 0  */
#define IOCON_PinConfig_3_4_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_3_4)  /*!< Pin 3.4 configured as PIO                    */
#define IOCON_PinConfig_2_4_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_2_4)  /*!< Pin 2.4 configured as PIO                    */
#define IOCON_PinConfig_2_5_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_2_5)  /*!< Pin 2.5 configured as PIO                    */
#define IOCON_PinConfig_3_5_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_3_5)  /*!< Pin 3.5 configured as PIO                    */
#define IOCON_PinConfig_0_6_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_0_6)  /*!< Pin 0.6 configured as PIO                    */
#define IOCON_PinConfig_0_6_SCK0         (((((uint16_t)IOCON_Function_Alt2) << 8))    | IOCON_Pin_0_6)  /*!< Pin 0.6 configured as SSP0 SCK               */
#define IOCON_PinConfig_0_7_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_0_7)  /*!< Pin 0.7 configured as PIO                    */
#define IOCON_PinConfig_0_7_CTS0         (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_0_7)  /*!< Pin 0.7 configured as UART0 CTS              */
#define IOCON_PinConfig_2_9_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_2_9)  /*!< Pin 2.9 configured as PIO                    */
#define IOCON_PinConfig_2_10_PIO         (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_2_10) /*!< Pin 2.10 configured as PIO                   */
#define IOCON_PinConfig_2_2_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_2_2)  /*!< Pin 2.2 configured as PIO                    */
#define IOCON_PinConfig_2_2_DCD0         (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_2_2)  /*!< Pin 2.2 configured as UART0 DCD              */
#define IOCON_PinConfig_2_2_MISO1        (((((uint16_t)IOCON_Function_Alt2) << 8))    | IOCON_Pin_2_2)  /*!< Pin 2.2 configured as SSP1 MISO              */
#define IOCON_PinConfig_0_8_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_0_8)  /*!< Pin 0.8 configured as PIO                    */
#define IOCON_PinConfig_0_8_MISO0        (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_0_8)  /*!< Pin 0.8 configured as SSP0 MISO              */
#define IOCON_PinConfig_0_8_CT16B0_MAT0  (((((uint16_t)IOCON_Function_Alt2) << 8))    | IOCON_Pin_0_8)  /*!< Pin 0.8 configured as CT16B0 Match Output 0  */
#define IOCON_PinConfig_0_9_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_0_9)  /*!< Pin 0.9 configured as PIO                    */
#define IOCON_PinConfig_0_9_MOSI0        (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_0_9)  /*!< Pin 0.9 configured as SSP0 MOSI              */
#define IOCON_PinConfig_0_9_CT16B0_MAT1  (((((uint16_t)IOCON_Function_Alt2) << 8))    | IOCON_Pin_0_9)  /*!< Pin 0.9 configured as CT16B0 Match Output 1  */
#define IOCON_PinConfig_0_10_SWCLK       (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_0_10) /*!< Pin 0.10 configured as debug SWCLK pin       */
#define IOCON_PinConfig_0_10_PIO         (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_0_10) /*!< Pin 0.10 configured as PIO                   */
#define IOCON_PinConfig_0_10_SCK0        (((((uint16_t)IOCON_Function_Alt2) << 8))    | IOCON_Pin_0_10) /*!< Pin 0.10 configured as SSP0 SCK              */
#define IOCON_PinConfig_0_10_CT16B0_MAT2 (((((uint16_t)IOCON_Function_Alt3) << 8))    | IOCON_Pin_0_10) /*!< Pin 0.10 configured as CT16B0 Match Output 2 */
#define IOCON_PinConfig_1_10_PIO         (((((uint16_t)IOCON_Function_Default \
                                                       | IOCON_ADMode_Digital) << 8)) | IOCON_Pin_1_10) /*!< Pin 1.10 configured as PIO                   */
#define IOCON_PinConfig_1_10_AD6         (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_1_10) /*!< Pin 1.10 configured as ADC Input 6           */
#define IOCON_PinConfig_1_10_CT16B1_MAT1 (((((uint16_t)IOCON_Function_Alt2 \
                                                    | IOCON_ADMode_Digital) << 8))    | IOCON_Pin_1_10) /*!< Pin 1.10 configured as CT16B1 Match Output 1 */
#define IOCON_PinConfig_2_11_PIO         (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_2_11) /*!< Pin 2.11 configured as PIO                   */
#define IOCON_PinConfig_2_11_SCK0        (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_2_11) /*!< Pin 2.11 configured as SSP0 SCK              */
#define IOCON_PinConfig_0_11_PIO         (((((uint16_t)IOCON_Function_Alt1 \
                                                    | IOCON_ADMode_Digital) << 8))    | IOCON_Pin_0_11) /*!< Pin 0.11 configured as PIO                   */
#define IOCON_PinConfig_0_11_AD0         (((((uint16_t)IOCON_Function_Alt2) << 8))    | IOCON_Pin_0_11) /*!< Pin 0.11 configured as ADC Input 0           */
#define IOCON_PinConfig_0_11_CT32B0_MAT3 (((((uint16_t)IOCON_Function_Alt3 \
                                                    | IOCON_ADMode_Digital) << 8))    | IOCON_Pin_0_11) /*!< Pin 0.11 configured as CT32B0 Match Output 3 */
#define IOCON_PinConfig_1_0_PIO          (((((uint16_t)IOCON_Function_Alt1 \
                                                    | IOCON_ADMode_Digital) << 8))    | IOCON_Pin_1_0)  /*!< Pin 1.0 configured as PIO                    */
#define IOCON_PinConfig_1_0_AD1          (((((uint16_t)IOCON_Function_Alt2) << 8))    | IOCON_Pin_1_0)  /*!< Pin 1.0 configured as ADC Input 1            */
#define IOCON_PinConfig_1_0_CT32B1_CAP0  (((((uint16_t)IOCON_Function_Alt3 \
                                                    | IOCON_ADMode_Digital) << 8))    | IOCON_Pin_1_0)  /*!< Pin 1.0 configured as CT32B1 Capture Input 0 */
#define IOCON_PinConfig_1_1_PIO          (((((uint16_t)IOCON_Function_Alt1 \
                                                    | IOCON_ADMode_Digital) << 8))    | IOCON_Pin_1_1)  /*!< Pin 1.1 configured as PIO                    */
#define IOCON_PinConfig_1_1_AD2          (((((uint16_t)IOCON_Function_Alt2) << 8))    | IOCON_Pin_1_1)  /*!< Pin 1.1 configured as ADC Input 2            */
#define IOCON_PinConfig_1_1_CT32B1_MAT0  (((((uint16_t)IOCON_Function_Alt3 \
                                                    | IOCON_ADMode_Digital) << 8))    | IOCON_Pin_1_1)  /*!< Pin 1.1 configured as CT32B1 Match Output 0  */
#define IOCON_PinConfig_1_2_PIO          (((((uint16_t)IOCON_Function_Alt1 \
                                                    | IOCON_ADMode_Digital) << 8))    | IOCON_Pin_1_2)  /*!< Pin 1.2 configured as PIO                    */
#define IOCON_PinConfig_1_2_AD3          (((((uint16_t)IOCON_Function_Alt2) << 8))    | IOCON_Pin_1_2)  /*!< Pin 1.2 configured as ADC Input 3            */
#define IOCON_PinConfig_1_2_CT32B1_MAT1  (((((uint16_t)IOCON_Function_Alt3 \
                                                    | IOCON_ADMode_Digital) << 8))    | IOCON_Pin_1_2)  /*!< Pin 1.2 configured as CT32B1 Match Output 1  */
#define IOCON_PinConfig_3_0_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_3_0)  /*!< Pin 3.0 configured as PIO                    */
#define IOCON_PinConfig_3_0_DTR0         (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_3_0)  /*!< Pin 3.0 configured as UART0 DTR              */
#define IOCON_PinConfig_3_1_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_3_1)  /*!< Pin 3.1 configured as PIO                    */
#define IOCON_PinConfig_3_1_DSR0         (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_3_1)  /*!< Pin 3.1 configured as UART0 DSR              */
#define IOCON_PinConfig_2_3_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_2_3)  /*!< Pin 2.3 configured as PIO                    */
#define IOCON_PinConfig_2_3_RI0          (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_2_3)  /*!< Pin 2.3 configured as UART0 RI               */
#define IOCON_PinConfig_2_3_MOSI1        (((((uint16_t)IOCON_Function_Alt2) << 8))    | IOCON_Pin_2_3)  /*!< Pin 2.3 configured as SSP1 MOSI              */
#define IOCON_PinConfig_1_3_SWDIO        (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_1_3)  /*!< Pin 1.3 configured as debug SWDIO            */
#define IOCON_PinConfig_1_3_PIO          (((((uint16_t)IOCON_Function_Alt1 \
                                                    | IOCON_ADMode_Digital) << 8))    | IOCON_Pin_1_3)  /*!< Pin 1.3 configured as PIO                    */
#define IOCON_PinConfig_1_3_AD4          (((((uint16_t)IOCON_Function_Alt2) << 8))    | IOCON_Pin_1_3)  /*!< Pin 1.3 configured as ADC Input 4            */
#define IOCON_PinConfig_1_3_CT32B1_MAT2  (((((uint16_t)IOCON_Function_Alt3 \
                                                    | IOCON_ADMode_Digital) << 8))    | IOCON_Pin_1_3)  /*!< Pin 1.3 configured as CT32B1 Match Output 2  */
#define IOCON_PinConfig_1_4_PIO          (((((uint16_t)IOCON_Function_Default \
                                                       | IOCON_ADMode_Digital) << 8)) | IOCON_Pin_1_4)  /*!< Pin 1.4 configured as PIO                    */
#define IOCON_PinConfig_1_4_AD5          (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_1_4)  /*!< Pin 1.4 configured as ADC Input 5            */
#define IOCON_PinConfig_1_4_CT32B1_MAT3  (((((uint16_t)IOCON_Function_Alt2 \
                                                    | IOCON_ADMode_Digital) << 8))    | IOCON_Pin_1_4)  /*!< Pin 1.4 configured as CT32B1 Match Output 3  */
#define IOCON_PinConfig_1_11_PIO         (((((uint16_t)IOCON_Function_Default \
                                                       | IOCON_ADMode_Digital) << 8)) | IOCON_Pin_1_11) /*!< Pin 1.11 configured as PIO                   */
#define IOCON_PinConfig_1_11_AD7         (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_1_11) /*!< Pin 1.11 configured as ADC Input 7           */
#define IOCON_PinConfig_3_2_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_3_2)  /*!< Pin 3.2 configured as PIO                    */
#define IOCON_PinConfig_3_2_DCD0         (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_3_2)  /*!< Pin 3.2 configured as UART0 DCD              */
#define IOCON_PinConfig_1_5_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_1_5)  /*!< Pin 1.5 configured as PIO                    */
#define IOCON_PinConfig_1_5_RTS0         (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_1_5)  /*!< Pin 1.5 configured as UART0 RTS              */
#define IOCON_PinConfig_1_5_CT32B0_CAP0  (((((uint16_t)IOCON_Function_Alt2) << 8))    | IOCON_Pin_1_5)  /*!< Pin 1.5 configured as CT32B0 Capture Input 0 */
#define IOCON_PinConfig_1_6_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_1_6)  /*!< Pin 1.6 configured as PIO                    */
#define IOCON_PinConfig_1_6_RXD0         (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_1_6)  /*!< Pin 1.6 configured as UART0 RXD              */
#define IOCON_PinConfig_1_6_CT32B0_MAT0  (((((uint16_t)IOCON_Function_Alt2) << 8))    | IOCON_Pin_1_6)  /*!< Pin 1.6 configured as CT32B0 Match Output 0  */
#define IOCON_PinConfig_1_7_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_1_7)  /*!< Pin 1.7 configured as PIO                    */
#define IOCON_PinConfig_1_7_TXD0         (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_1_7)  /*!< Pin 1.7 configured as UART0 TXD              */
#define IOCON_PinConfig_1_7_CT32B0_MAT1  (((((uint16_t)IOCON_Function_Alt2) << 8))    | IOCON_Pin_1_7)  /*!< Pin 1.7 configured as CT32B0 Match Output 1  */
#define IOCON_PinConfig_3_3_PIO          (((((uint16_t)IOCON_Function_Default) << 8)) | IOCON_Pin_3_3)  /*!< Pin 3.3 configured as PIO                    */
#define IOCON_PinConfig_3_3_RI0          (((((uint16_t)IOCON_Function_Alt1) << 8))    | IOCON_Pin_3_3)  /*!< Pin 3.3 configured as UART0 RI               */

/*! @brief Type used for passing pin configuration settings */
typedef uint32_t IOCON_PinConfig_Type;

/** @} */

/**
  * @}
  */


/* Inline Functions ---------------------------------------------------------*/

