tymmothy/LPC11xx_Device_Lib_v1.2/inc/lpc11xx/iocon.h
/** @addtogroup IOCON_InlineFunctions IOCON Interface Inline Functions
  * @{
  */

/** @brief Set the function for an IO pin.
  * @param[in]  pin          An IOCON pin number
  * @param[in]  function     The new pin function
  */
__INLINE static void IOCON_SetPinFunction(IOCON_Pin_Type pin, IOCON_Function_Type function)
{
    lpclib_assert(IOCON_IS_PIN(pin));
    lpclib_assert(IOCON_IS_FUNCTION(function));

    ((__IO uint32_t *)IOCON)[pin] = (((__IO uint32_t *)IOCON)[pin] & ~IOCON_Function_Mask)
                                    | function;
}

/** @brief Get the current function of an IO pin.
  * @param[in]  pin          An IOCON pin number
  * @return                  A token indicating the current pin function.
  */
__INLINE static IOCON_Function_Type IOCON_GetPinFunction(IOCON_Pin_Type pin)
{
    return ((__IO uint32_t *)IOCON)[pin] & IOCON_Function_Mask;
}

/** @brief Simple IO pin configuration function.
  * @param[in]  config       A pin/function hybrid configuration setting
  * @param[in]  mode         The resistor/repeater mode to configure for the pin
  */
__INLINE static void IOCON_SetPinConfig(IOCON_PinConfig_Type config, IOCON_Mode_Type mode)
{
    uint16_t pin = config & 0xff;


    lpclib_assert(IOCON_IS_PIO_PIN(pin));
    lpclib_assert(IOCON_IS_FUNCTION(config >> 8));
    lpclib_assert(IOCON_IS_MODE(mode));

    ((__IO uint32_t *)IOCON)[pin] =
        (((__IO uint32_t *)IOCON)[pin] & ~(IOCON_Function_Mask | IOCON_Mode_Mask))
        | (config >> 8) | mode;
}

/** @brief Enable hysteresis on an IO pin.
  * @param[in]  pin          An IOCON pin number
  */
__INLINE static void IOCON_EnablePinHysteresis(IOCON_Pin_Type pin)
{
    lpclib_assert(IOCON_IS_PIN(pin));

    ((__IO uint32_t *)IOCON)[pin] |= IOCON_HYS;
}

/** @brief  Disable hysteresis on an IO pin.
  * @param[in]  pin          An IOCON pin number
  */
__INLINE static void IOCON_DisablePinHysteresis(IOCON_Pin_Type pin)
{
    lpclib_assert(IOCON_IS_PIN(pin));

    ((__IO uint32_t *)IOCON)[pin] &= ~IOCON_HYS;
}

/** @brief  Get the current hysteresis setting of an IO pin.
  * @param[in]  pin          An IOCON pin number
  * @return                  1 if hysteresis is enabled on the pin, 0 otherwise.
  */
__INLINE unsigned int IOCON_PinHysteresisIsEnabled(IOCON_Pin_Type pin)
{
    return (((__IO uint32_t *)IOCON)[pin] & IOCON_HYS) ? 1:0;
}

/** @brief Set the mode (resistor/repeater setting) of an IO pin.
  * @param[in]  pin          An IOCON pin number
  * @param[in]  mode         The new mode setting
  */
__INLINE static void IOCON_SetPinMode(IOCON_Pin_Type pin,
                                      IOCON_Mode_Type mode)
{
    lpclib_assert(IOCON_IS_PIN(pin));
    lpclib_assert(IOCON_IS_MODE(mode));

    ((__IO uint32_t *)IOCON)[pin] = (((__IO uint32_t *)IOCON)[pin] & ~IOCON_Mode_Mask)
                                    | mode;
}

/** @brief  Get the current mode (resistor/repeater setting) of an IO pin.
  * @param[in]  pin          An IOCON pin number
  * @return                  The current pin mode.
  */
__INLINE static IOCON_Mode_Type IOCON_GetPinMode(IOCON_Pin_Type pin)
{
    lpclib_assert(IOCON_IS_PIN(pin));

    return (((__IO uint32_t *)IOCON)[pin] & IOCON_Mode_Mask);
}

/** @brief Set Pin I2C Mode
  * @param[in]  pin          An IOCON pin number (IOCON_Pin_Pin_PIO_0_4/0_5 Only)
  * @param[in]  i2c_mode     The new I2C mode
  */
__INLINE static void IOCON_SetPinI2CMode(IOCON_Pin_Type pin,
                                         IOCON_I2CMode_Type i2c_mode)
{
    lpclib_assert(IOCON_IS_I2C_PIN(pin));
    lpclib_assert(IOCON_IS_I2C_MODE(i2c_mode));

    ((__IO uint32_t *)IOCON)[pin] = (((__IO uint32_t *)IOCON)[pin] & ~IOCON_I2C_Mask)
                                    | i2c_mode;
}

/** @brief Get the current I2C mode of an IO pin.
  * @param[in]  pin          An IOCON pin number (IOCON_Pin_Pin_PIO_0_4/0_5 Only)
  * @return                  The current I2C mode of the pin.
  */
__INLINE static IOCON_I2CMode_Type IOCON_GetPinI2CMode(IOCON_Pin_Type pin)
{
    lpclib_assert(IOCON_IS_I2C_PIN(pin));

    return ((__IO uint32_t *)IOCON)[pin] & IOCON_I2C_Mask;
}

/** @brief Enable analog mode on an IO pin.
  * @param[in]  pin          An IOCON pin number (ADC input pins only)
  */
__INLINE static void IOCON_EnablePinAnalogMode(IOCON_Pin_Type pin)
{
    lpclib_assert(IOCON_IS_AD_PIN(pin));

    /* Note: AD bit is 0 when Analog Mode is enabled */
    ((__IO uint32_t *)IOCON)[pin] &= ~IOCON_AD;
}

/** @brief Disable analog mode on an IO pin.
  * @param[in]  pin          An IOCON pin number (ADC input pins only)
  */
__INLINE static void IOCON_DisablePinAnalogMode(IOCON_Pin_Type pin)
{
    lpclib_assert(IOCON_IS_AD_PIN(pin));

    /* Note: AD bit is 0 when Analog Mode is enabled */
    ((__IO uint32_t *)IOCON)[pin] |= IOCON_AD;
}

/** @brief Test whether analog mode is enabled on an IO pin.
  * @param[in]  pin          An IOCON pin number (ADC input pins only)
  * @return                  1 if AD mode is enabled on the pin, 0 otherwise.
  */
__INLINE static void IOCON_EnablePinAnalogMode(IOCON_Pin_Type pin)
{
   lpclib_assert(IOCON_IS_AD_PIN(pin));

    return (((__IO uint32_t *)IOCON)[pin] & IOCON_AD) ? 0:1;
}

#if defined(LPC11XXL)  /* L-series parts only; pseudo Open-Drain Mode */

/** @brief Enable pseudo open-drain mode on an IO pin.
  * @param[in]  pin          An IOCON pin number (non-I2C pins only)
  */
__INLINE static void IOCON_EnablePinODMode(IOCON_Pin_Type pin)
{
    lpclib_assert(IOCON_IS_OD_PIN(pin));

    ((__IO uint32_t *)IOCON)[pin] |= IOCON_OD;
}

/** @brief Disable pseudo open-drain mode on an IO pin.
  * @param[in]  pin          An IOCON pin number (non-I2C pins only)
  */
__INLINE static void IOCON_DisablePinOpenDrainMode(IOCON_Pin_Type pin)
{
    lpclib_assert(IOCON_IS_OD_PIN(pin));

    ((__IO uint32_t *)IOCON)[pin] &= ~IOCON_OD;
}

#endif /* #if defined(LPC11XXL) */

/** @brief Set the location of SSP0's SCK pin.
  * @param[in]  loc          The location to route the signal.
  */
__INLINE static void IOCON_SetSCK0Location(IOCON_SCK0Location_Type loc)
{
    lpclib_assert(IOCON_IS_SCK0_LOCATION(loc));

    IOCON->SCK0_LOC = loc;
}

/** @brief Get the current location of SSP0's SCK pin.
  * @return                  The current location of the SCK pin.
  */
__INLINE static IOCON_SCK0Location_Type IOCON_GetSCK0Location(void)
{
    return IOCON->SCK0_LOC;
}

/** @brief Set the location of UART0's DSR pin.
  * @param[in]  loc          The location to route the signal.
  */
__INLINE static void IOCON_SetDSR0Location(IOCON_DSR0Location_Type loc)
{
    lpclib_assert(IOCON_IS_DSR0_LOCATION(loc));

    IOCON->DSR0_LOC = loc;
}

/** @brief Get the current location of UART0's DSR pin.
  * @return                  The current location of the DSR pin.
  */
__INLINE static IOCON_DSR0Location_Type IOCON_GetDSR0Location(void)
{
    return IOCON->DSR0_LOC;
}

/** @brief Set the location of UART0's DCD pin.
  * @param[in]  loc          The location to route the signal.
  */
__INLINE static void IOCON_SetDCD0Location(IOCON_DCD0Location_Type loc)
{
    lpclib_assert(IOCON_IS_DCD0_LOCATION(loc));

    IOCON->DCD0_LOC = loc;
}

/** @brief Get the current location of UART0's DCD pin.
  * @return                  The current location of the DCD pin.
  */
__INLINE static IOCON_DCD0Location_Type IOCON_GetDCD0Location(void)
{
    return IOCON->DCD0_LOC;
}

/** @brief Set the location of UART0's RI pin.
  * @param[in]  loc          The location to route the signal.
  */
__INLINE static void IOCON_SetRI0Location(IOCON_RI0Location_Type loc)
{
    lpclib_assert(IOCON_IS_RI0_LOCATION(loc));

    IOCON->RI0_LOC = loc;
}

/** @brief Get the current location of UART0's RI pin.
  * @return                  The current location of the RI pin.
  */
__INLINE static IOCON_RI0Location_Type IOCON_GetRI0Location(void)
{
    return IOCON->RI0_LOC;
}

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
};
#endif

#endif /* #ifndef NXP_LPC_IOCON_H_ */
